# DimToIntersectingWalls Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DimToIntersectingWalls Property
ParameterTypeId Class See Also
---
"Dimension To Intersecting Walls"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DimToIntersectingWalls { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DimToIntersectingWalls As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DimToIntersectingWalls {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace